## Chapter 4

### Summarizing Statistics

In [1]:
# Importing libraries pandas and numpy 
import pandas as pd 
import numpy as np

In [2]:
# Generating random values with use of randint of numpy

values1 = np.random.randint(500,size=10000) # This is generating an ndarray of 10000 random integers between [0-500).
values2 = pd.Series(np.random.randint(500,size=10000)) # This is generating a pd series of 10000 random integers between [0,500).

In [3]:
#Displaying the Values1
values1[:10]

array([454, 465, 464, 425, 140, 473, 207, 198, 428,   6])

In [4]:
#Displaying the Values2 
values2[:10]

0    402
1    307
2    237
3     77
4    448
5    162
6     15
7    373
8    494
9    283
dtype: int32

In [5]:
# Printing the basic Statistics functions.

print('MIN(values1)= '+str(values1.min())+'\t\t\tMIN(values2)= ' +str(values2.min())) # Printing the Min Value in both the value tables
print('MAX(values1)= '+str(values1.max())+'\t\t\tMAX(values2)= ' +str(values2.max())) # Printing the Max values in both the value tables
print('Range(values1)= '+str(values1.ptp())+'\t\t\tRange(values2)= ' +str(values2.ptp())) #Printing the Range of both the value tables
print('Mean(values1)= '+str(values1.mean())+'\t\t\tMean(values2)= ' +str(values2.mean())) # Priinting the Mean of both the value table
print('StDev(values1)= '+str(values1.std())+'\t\t\tStDev(values2)= ' +str(values2.std())) # Printing the STDev of both the value table
print('Variance(values1)= '+str(values1.var())+'\t\t\tVariance(values2)= ' +str(values2.var())) # Printing the variance of both the value table

MIN(values1)= 0			MIN(values2)= 0
MAX(values1)= 499			MAX(values2)= 499
Range(values1)= 499			Range(values2)= 499
Mean(values1)= 247.2809			Mean(values2)= 249.7574
StDev(values1)= 143.447374306			StDev(values2)= 143.59922011919838
Variance(values1)= 20577.1491952			Variance(values2)= 20620.736018841984

In [6]:
# Pandas has the descirbe feature which would display the basic statistics of the given series
values2.describe()

count    10000.00000
mean       249.75740
std        143.59922
min          0.00000
25%        126.75000
50%        250.00000
75%        375.00000
max        499.00000
dtype: float64

In [7]:
# Trying the describe function with non numeric series objects.
nonnumeric = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])
nonnumeric.describe() # Here they display the no of unique obbjects, top object,Frequently occured object count

count     9
unique    4
top       a
freq      5
dtype: object

### Missing Values

In [8]:
# Creating a dataframe with random numbers ( 5rows, 3 columns)

df= pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three']) #randn return standard normal distribution no's
df

        one       two     three
a  0.107766 -0.346065 -0.130684
c -1.517429  0.540282 -0.099146
e -1.181490 -1.836504  1.343306
f  0.700559 -0.433521 -0.574937
h -0.375681 -0.341239 -1.153593

In [9]:
# Adding two more columns to the existing DF
df['four']=['bar','barr','barrr','barrrr','barrrrr']
df['five']=df['one']>0 # Trying to display the boolean value for this row which should have value greater than 0
df

        one       two     three     four   five
a  0.107766 -0.346065 -0.130684      bar   True
c -1.517429  0.540282 -0.099146     barr  False
e -1.181490 -1.836504  1.343306    barrr  False
f  0.700559 -0.433521 -0.574937   barrrr   True
h -0.375681 -0.341239 -1.153593  barrrrr  False

In [10]:
# Reindexing the previous DF , henceforth adding empty rows
df2= df.reindex(['a','b','c','d','e','f','g','h'])
df2  # This DF now has empty rows added and the previous DF data

        one       two     three     four   five
a  0.107766 -0.346065 -0.130684      bar   True
b       NaN       NaN       NaN      NaN    NaN
c -1.517429  0.540282 -0.099146     barr  False
d       NaN       NaN       NaN      NaN    NaN
e -1.181490 -1.836504  1.343306    barrr  False
f  0.700559 -0.433521 -0.574937   barrrr   True
g       NaN       NaN       NaN      NaN    NaN
h -0.375681 -0.341239 -1.153593  barrrrr  False

In [11]:
# Trying to change the index to a row
df2.ix['a'] #Displaying the elements of the row a with their respective column names

C:\Users\MosesAbishekRaj\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

one      0.107766
two     -0.346065
three   -0.130684
four          bar
five         True
Name: a, dtype: object

In [12]:
# Trying to identify the null values in a column

pd.isnull(df2['three']) # Using the 'isnull' keyword in pandas to identify the null values

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: three, dtype: bool

In [13]:
# Trying to identify the null values in a column

pd.notnull(df2['one']) # Also we can use the notnull to identify the values which are not null in a given column

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [14]:
b= df[['one','two','three']]
b

        one       two     three
a  0.107766 -0.346065 -0.130684
c -1.517429  0.540282 -0.099146
e -1.181490 -1.836504  1.343306
f  0.700559 -0.433521 -0.574937
h -0.375681 -0.341239 -1.153593

In [15]:
# Creating a DF where  has the df columns one and two
a = df[['one','two']]
a['one']['a':'e']= float('nan') # Making the values from a:e in the column 'one' to nan
a

C:\Users\MosesAbishekRaj\Anaconda3\lib\site-packages\pandas\core\series.py:767: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
C:\Users\MosesAbishekRaj\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2862: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN -0.346065
c       NaN  0.540282
e       NaN -1.836504
f  0.700559 -0.433521
h -0.375681 -0.341239

In [16]:
#Addition of the two DFs consisting of NAN values
a+b  # Here the nan values are considered as zero when added

        one  three       two
a       NaN    NaN -0.692131
c       NaN    NaN  1.080565
e       NaN    NaN -3.673007
f  1.401117    NaN -0.867042
h -0.751363    NaN -0.682478

In [17]:
#Trying the mean function on the column 1
a.mean(1)

a   -0.346065
c    0.540282
e   -1.836504
f    0.133519
h   -0.358460
dtype: float64

In [18]:
#Trying the sum of the specific column objects
a['one'].sum()

0.3248772771986918

### Histograms

In [20]:
pdhist = values2.hist()
pdhist

In [21]:
pdhist2 = values2.hist(bins=20, color='r',alpha=0.4, figsize=(10,6))
pdhist2